barsgl/barsgl-ejbparent/barsgl-ejbtest/src/test/resources/AccountDetailsNotifyFcc6Open.xml

<?xml version="1.0" encoding="utf-8"?>
<NS1:Envelope xmlns:NS1="http://schemas.xmlsoap.org/soap/envelope/">
    <NS1:Header>
        <NS2:UCBRUHeaders xmlns:NS2="urn:imb:gbo:v2">
            <NS2:Audit>
                <NS2:MessagePath>
                    <NS2:Step>
                        <NS2:Application.Module>SRVACC.AccountDetailsNotify.NotificationHandler</NS2:Application.Module>
                        <NS2:VersionId>v4</NS2:VersionId>
                        <NS2:TimeStamp>2016-03-29T17:50:54.289+03:00</NS2:TimeStamp>
                        <NS2:RoutingRole>START</NS2:RoutingRole>
                        <NS2:Comment/>
                    </NS2:Step>
                    <NS2:Step>
                        <NS2:Application.Module>SRVACC.AccountListQuery</NS2:Application.Module>
                        <NS2:VersionId>v2</NS2:VersionId>
                        <NS2:TimeStamp>2016-03-29T17:50:54.295+03:00</NS2:TimeStamp>
                        <NS2:RoutingRole>START</NS2:RoutingRole>
                        <NS2:Comment/>
                    </NS2:Step>
                    <NS2:Step>
                        <NS2:Application.Module>SRVACC.AccountListQuery</NS2:Application.Module>
                        <NS2:VersionId>v2</NS2:VersionId>
                        <NS2:TimeStamp>2016-03-29T17:50:54.405+03:00</NS2:TimeStamp>
                        <NS2:RoutingRole>SUCCESS</NS2:RoutingRole>
                        <NS2:Comment/>
                    </NS2:Step>
                    <NS2:Step>
                        <NS2:Application.Module>SRVACC.AccountDetailsNotify.Publisher</NS2:Application.Module>
                        <NS2:VersionId>v2</NS2:VersionId>
                        <NS2:TimeStamp>2016-03-29T17:50:54.413+03:00</NS2:TimeStamp>
                        <NS2:RoutingRole>SUCCESS</NS2:RoutingRole>
                        <NS2:Comment></NS2:Comment>
                    </NS2:Step>
                </NS2:MessagePath>
            </NS2:Audit>
        </NS2:UCBRUHeaders>
    </NS1:Header>
    <NS1:Body>
        <gbo:AccountList xmlns:gbo="urn:imb:gbo:v2">
            <gbo:AccountDetails>
                <gbo:AccountNo>00516770RURPRDC101</gbo:AccountNo>
                <gbo:Branch>A01</gbo:Branch>
                <gbo:CBAccountNo>40817810000010696538</gbo:CBAccountNo>
                <gbo:Ccy>RUR</gbo:Ccy>
                <gbo:CcyDigital>810</gbo:CcyDigital>
                <gbo:Description>KOZHEMYAKO D.A.-VE</gbo:Description>
                <gbo:Status>O</gbo:Status>
                <gbo:CustomerNo>00516770</gbo:CustomerNo>
                <gbo:Special>PRDC1</gbo:Special>
                <gbo:OpenDate>2003-03-29</gbo:OpenDate>
                <gbo:AltAccountNo>516770RUR405712001</gbo:AltAccountNo>
                <gbo:Type>S</gbo:Type>
                <gbo:ATMAvailable>N</gbo:ATMAvailable>
                <gbo:IsFrozen>N</gbo:IsFrozen>
                <gbo:IsDormant>N</gbo:IsDormant>
                <gbo:CreditTransAllowed>Y</gbo:CreditTransAllowed>
                <gbo:DebitTransAllowed>Y</gbo:DebitTransAllowed>
                <gbo:ClearingBank>044525545</gbo:ClearingBank>
                <gbo:CorBank>044525545</gbo:CorBank>
                <gbo:Positioning>
                    <gbo:CBAccount>40817810000010696539</gbo:CBAccount>
                    <gbo:IMBAccountNo>40817810000010696539</gbo:IMBAccountNo>
                    <gbo:IMBBranch>001</gbo:IMBBranch>
                    <gbo:HostABSAccountNo>00516770RURPRDC101</gbo:HostABSAccountNo>
                    <gbo:HostABSBranch>A01</gbo:HostABSBranch>
                    <gbo:HostABS>FCC</gbo:HostABS>
                </gbo:Positioning>
                <gbo:MIS>
                    <gbo:Pool>DFLTPOOL</gbo:Pool>
                    <gbo:TransactionClass>
                        <gbo:Name>TXNMIS1</gbo:Name>
                    </gbo:TransactionClass>
                    <gbo:TransactionClass>
                        <gbo:Name>TXNMIS2</gbo:Name>
                    </gbo:TransactionClass>
                    <gbo:TransactionClass>
                        <gbo:Name>TXNMIS3</gbo:Name>
                    </gbo:TransactionClass>
                    <gbo:TransactionClass>
                        <gbo:Name>TXNMIS4</gbo:Name>
                    </gbo:TransactionClass>
                    <gbo:TransactionClass>
                        <gbo:Name>TXNMIS5</gbo:Name>
                    </gbo:TransactionClass>
                    <gbo:TransactionClass>
                        <gbo:Name>TXNMIS6</gbo:Name>
                    </gbo:TransactionClass>
                    <gbo:TransactionClass>
                        <gbo:Name>TXNMIS7</gbo:Name>
                    </gbo:TransactionClass>
                    <gbo:TransactionClass>
                        <gbo:Name>TXNMIS8</gbo:Name>
                    </gbo:TransactionClass>
                    <gbo:TransactionClass>
                        <gbo:Name>TXNMIS9</gbo:Name>
                    </gbo:TransactionClass>
                    <gbo:TransactionClass>
                        <gbo:Name>TXNMIS10</gbo:Name>
                    </gbo:TransactionClass>
                    <gbo:CompositeClass>
                        <gbo:Name>COMPMIS1</gbo:Name>
                    </gbo:CompositeClass>
                    <gbo:CompositeClass>
                        <gbo:Name>COMPMIS2</gbo:Name>
                    </gbo:CompositeClass>
                    <gbo:CompositeClass>
                        <gbo:Name>COMPMIS3</gbo:Name>
                    </gbo:CompositeClass>
                    <gbo:CompositeClass>
                        <gbo:Name>COMPMIS4</gbo:Name>
                    </gbo:CompositeClass>
                    <gbo:CompositeClass>
                        <gbo:Name>COMPMIS5</gbo:Name>
                    </gbo:CompositeClass>
                    <gbo:CompositeClass>
                        <gbo:Name>COMPMIS6</gbo:Name>
                    </gbo:CompositeClass>
                    <gbo:CompositeClass>
                        <gbo:Name>COMPMIS7</gbo:Name>
                    </gbo:CompositeClass>
                    <gbo:CompositeClass>
                        <gbo:Name>COMPMIS8</gbo:Name>
                    </gbo:CompositeClass>
                    <gbo:CompositeClass>
                        <gbo:Name>COMPMIS9</gbo:Name>
                    </gbo:CompositeClass>
                    <gbo:CompositeClass>
                        <gbo:Name>COMPMIS10</gbo:Name>
                    </gbo:CompositeClass>
                    <gbo:CostCode>
                        <gbo:Name>COSTCOD1</gbo:Name>
                    </gbo:CostCode>
                    <gbo:CostCode>
                        <gbo:Name>COSTCOD2</gbo:Name>
                    </gbo:CostCode>
                    <gbo:CostCode>
                        <gbo:Name>COSTCOD3</gbo:Name>
                    </gbo:CostCode>
                    <gbo:CostCode>
                        <gbo:Name>COSTCOD4</gbo:Name>
                    </gbo:CostCode>
                    <gbo:CostCode>
                        <gbo:Name>COSTCOD5</gbo:Name>
                    </gbo:CostCode>
                </gbo:MIS>
                <gbo:UDF>
                    <gbo:Name>GWSAccType</gbo:Name>
                    <gbo:Value>CURR</gbo:Value>
                </gbo:UDF>
                <gbo:UDF>
                    <gbo:Name>OperationTypeCodes</gbo:Name>
                    <gbo:Value>VIEW=0,DOMPAY=1,CUPADE=0,CUPACO=0,</gbo:Value>
                </gbo:UDF>
                <gbo:UDF>
                    <gbo:Name>ParentBranchName</gbo:Name>
                    <gbo:Value>UCB, Moscow</gbo:Value>
                </gbo:UDF>
                <gbo:UDF>
                    <gbo:Name>CusSegment</gbo:Name>
                    <gbo:Value>TIER_I</gbo:Value>
                </gbo:UDF>
                <gbo:ShadowAccounts>
                    <gbo:HostABS>FCC</gbo:HostABS>
                    <gbo:AccountNo>00695430RURCOSA101</gbo:AccountNo>
                    <gbo:Branch>C04</gbo:Branch>
                </gbo:ShadowAccounts>
            </gbo:AccountDetails>
        </gbo:AccountList>
    </NS1:Body>
</NS1:Envelope>